#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_availability_zones.available: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-00c1fe534bc2f2145]
data.aws_elb_service_account.main: Reading...
aws_route53_zone.public_member: Refreshing state... [id=Z0475734GEJEVIBRK0MQ]
aws_acm_certificate.mig_cert: Refreshing state... [id=arn:aws:acm:eu-west-1:744618523292:certificate/e824c331-0b69-4e5a-aa2c-f421c660fa0e]
aws_s3_bucket.vpc_logs: Refreshing state... [id=migration-vpc-logs-cr]
aws_s3_bucket.elb_logs: Refreshing state... [id=migration-elb-logs-cr]
data.aws_kms_key.kms_key: Reading...
data.aws_iam_policy_document.allow_vpc: Reading...
data.aws_elb_service_account.main: Read complete after 0s [id=156460612806]
data.aws_iam_policy_document.allow_lb: Reading...
data.aws_iam_policy_document.allow_vpc: Read complete after 0s [id=3029433295]
data.aws_iam_policy_document.allow_lb: Read complete after 0s [id=797682585]
data.aws_kms_key.kms_key: Read complete after 0s [id=57d4cb18-52a5-498e-8cf0-226b34591cc9]
data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0ac07de7af3adeb60]
aws_route53_record.lb_validate["capci-gp4.aws.crlabs.cloud"]: Refreshing state... [id=Z0475734GEJEVIBRK0MQ__e4418acb376f615d22e8300d6cb3e924.capci-gp4.aws.crlabs.cloud._CNAME]
aws_route53_record.lb_validate["*.capci-gp4.aws.crlabs.cloud"]: Refreshing state... [id=Z0475734GEJEVIBRK0MQ__e4418acb376f615d22e8300d6cb3e924.capci-gp4.aws.crlabs.cloud._CNAME]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0ec5cd7f333716f5a]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-025fee03c2ae2b2cf]
aws_security_group.internet_face: Refreshing state... [id=sg-03934aeddf03f28d8]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-02138e41fbb9b879a]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-08c53d9526d9f4eb1]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-08bd0633d9398ea8d]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0bb4ac524f7fbe79f]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-028a4a58c90be2c17]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0b7e1a58bfb467345]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-022de9dd1bcfb9c1b]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-04249cb25d6bbf820]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-01b003db7faaec43b]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0b9c1b60b6b624608]
aws_s3_bucket_policy.allow-lb: Refreshing state... [id=migration-elb-logs-cr]
aws_s3_bucket_server_side_encryption_configuration.elb_encryption: Refreshing state... [id=migration-elb-logs-cr]
aws_s3_bucket_public_access_block.elb_bucket: Refreshing state... [id=migration-elb-logs-cr]
aws_s3_bucket_versioning.elb_version: Refreshing state... [id=migration-elb-logs-cr]
aws_s3_bucket_server_side_encryption_configuration.vpc_encryption: Refreshing state... [id=migration-vpc-logs-cr]
aws_s3_bucket_versioning.vpc_version: Refreshing state... [id=migration-vpc-logs-cr]
aws_s3_bucket_policy.allow-vpc: Refreshing state... [id=migration-vpc-logs-cr]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-08c53d9526d9f4eb11080289494]
aws_s3_bucket_public_access_block.vpc_bucket: Refreshing state... [id=migration-vpc-logs-cr]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0d8e4eba11474cab6]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0d02c2d8a816b434c]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-09d6dbc03fbecc24a]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-067207a3c5104ad3c]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0685344eb4ee2ba4c]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=migration-vpc]
module.vpc.aws_flow_log.this[0]: Refreshing state... [id=fl-06f951a6c956cc4e3]
aws_lb.migration_lb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:744618523292:loadbalancer/app/migration-lb/e101fe55961e098c]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0295bcbabbef7e515]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-08fad74eb2e4ffb8d]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-028a4a58c90be2c171080289494]
aws_route53_record.aliaslb: Refreshing state... [id=Z0475734GEJEVIBRK0MQ_*.capci-gp4.aws.crlabs.cloud_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lb_listener.front_end will be created
  + resource "aws_lb_listener" "front_end" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:eu-west-1:744618523292:certificate/e824c331-0b69-4e5a-aa2c-f421c660fa0e"
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:eu-west-1:744618523292:loadbalancer/app/migration-lb/e101fe55961e098c"
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-TLS13-1-2-2021-06"
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }
    }

  # aws_s3_bucket_policy.allow-vpc will be updated in-place
  ~ resource "aws_s3_bucket_policy" "allow-vpc" {
        id     = "migration-vpc-logs-cr"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource  = [
                            # (1 unchanged element hidden)
                            "arn:aws:s3:::migration-vpc-logs-cr",
                          - "arn:aws:s3:::migration-vpc-logs-cr/AWSLogs/744618523292/*",
                        ]
                        # (5 unchanged attributes hidden)
                    },
                    {
                        Action    = [
                            "s3:ListBucket",
                            "s3:GetBucketAcl",
                        ]
                        Condition = {
                            ArnLike      = {
                                "aws:SourceArn" = "arn:aws:logs:*:744618523292:*"
                            }
                            StringEquals = {
                                "aws:SourceAccount" = "744618523292"
                            }
                        }
                        Effect    = "Allow"
                        Principal = {
                            Service = "delivery.logs.amazonaws.com"
                        }
                        Resource  = [
                            "arn:aws:s3:::migration-vpc-logs-cr/*",
                            "arn:aws:s3:::migration-vpc-logs-cr",
                        ]
                        Sid       = "AWSLogDeliveryCheck"
                    },
                  - {
                      - Action    = "s3:GetBucketAcl"
                      - Condition = {
                          - ArnLike      = {
                              - "aws:SourceArn" = "arn:aws:logs:eu-west-1:744618523292:*"
                            }
                          - StringEquals = {
                              - "aws:SourceAccount" = "744618523292"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "delivery.logs.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::migration-vpc-logs-cr"
                      - Sid       = "AWSLogDeliveryAclCheck"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # time_sleep.wait_240_seconds will be created
  + resource "time_sleep" "wait_240_seconds" {
      + create_duration = "240s"
      + id              = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Warning: Duplicate required provider

  on alb.tf line 49:
  49: resource "time_sleep" "wait_240_seconds" {

Provider "registry.terraform.io/hashicorp/time" was implicitly required via
resource "time_sleep.wait_240_seconds", but listed in required_providers as
"hashicorp". Either the local name in required_providers must match the
resource name, or the "hashicorp" provider must be assigned within the
resource block.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @sathyarajdurai, Action: `pull_request`, Working Directory: 'cloud', Workflow: `migartion-cloud`*